benchmarks/parasiticRipples/N200/system/ijkDict
{
cellSet refinedCells;
cyclicX true;
}
