benchmarks/parasiticRipples/N200/system/setVelocityFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
 volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
      box (0 -1000 0.03) (1000 1000 1000);
      fieldValues
        (
	  volVectorFieldValue U (10 0 0)
        );
    }
);


// ************************************************************************* //
